In [42]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pickle   # this library helps to dump you model in form of an extention

In [14]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [15]:
df.shape

(8, 4)

In [16]:
df['experience'].fillna('zero', inplace=True)   # if I get a fresher his experience is 0

In [17]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [18]:
# now wherever test score is 0 fill the mean of the all test_scores
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(), inplace=True)

In [19]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [30]:
X=df.iloc[:,:3]

In [31]:
X   # without salary column

  experience  test_score(out of 10)  interview_score(out of 10)
0       zero               8.000000                           9
1       zero               8.000000                           6
2       five               6.000000                           7
3        two              10.000000                          10
4      seven               9.000000                           6
5      three               7.000000                          10
6        ten               7.857143                           7
7     eleven               7.000000                           8

In [33]:
# Now converting those experience text to numbers
def convert_to_int(word):
    dic={'zero':0, 'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8, 'nine':9,
        'ten':10, 'eleven':11, 'twelve':12}
    return dic[word]

In [34]:
X['experience']=X['experience'].apply(lambda x:convert_to_int(x))

In [36]:
X.head(2)

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6

In [38]:
y=df.iloc[:,-1]
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [40]:
# Now splitting training and testing dataset
# Since our dataset is too small we'll train on whole dataset
from sklearn.linear_model import LinearRegression
# why we used Linear Regression model here?
# Because we wanted specific values as output

In [41]:
regressor=LinearRegression()
regressor.fit(X,y)

LinearRegression()

In [43]:
# saving model to disk
pickle.dump(regressor, open('model.pkl', 'wb')) # this file will in dumped as model.pkl and will be dumped in write binary
# this file well be deployed in heroko

In [ ]:
int_features=[int(x) for x in request.form.values()]
    final_features=[np.ndarray(int_features)]
    predictions=model.predict(final_features)

In [47]:
X.iloc[:,]

   experience  test_score(out of 10)  interview_score(out of 10)
0           0               8.000000                           9
1           0               8.000000                           6
2           5               6.000000                           7
3           2              10.000000                          10
4           7               9.000000                           6
5           3               7.000000                          10
6          10               7.857143                           7
7          11               7.000000                           8

In [49]:
ls=[1,2,3,4]
np.array(ls)

array([1, 2, 3, 4])